---
kind: type
id: T:Autodesk.Revit.DB.Visual.WallpaintApplicationType
source: html/0e5c8c37-31fb-1271-a00a-4695457564fb.htm
---
# Autodesk.Revit.DB.Visual.WallpaintApplicationType

The enumerated type representing the permitted values for the asset property "WallpaintApplication" from the "WallPaint" schema.

## Syntax (C#)
```csharp
public enum WallpaintApplicationType
```